Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E01C.tmx
Source language: en_us
Languages: zh_cn

source: We tested it: Vinegar as a carpet cleaner
zh_cn: 经证实：食醋是很有用的地毯清洁剂

source: It turns out that the technique is just as important as the cleaning agent.
zh_cn: 事实证明，食醋清洁法和其他清洁剂一样有用。

source: When your pooch decides to track in mud or just do its business on the carpet, try cleaning it with vinegar (the carpet, not the dog).
zh_cn: 当你的爱犬决定在泥地里撒欢或在地毯上大便时，尝试用食醋去清洁它（是地毯，而不是狗狗）吧。

source: Sometimes, when it rains, my pooch decides that his precious paws are simply too delicate to become sullied with that icky mud, and he'd rather just not go outside to do his business.
zh_cn: 有时在下雨天，我的狗狗认为它娇贵的爪子不应该粘上恶心的泥巴，这时它就不那么愿意去室外排便了。

source: Yes, the corner of the living room will suffice, thank you very much.
zh_cn: 没错，客厅的一角就是它满意的排便场所。

source: I hate when it rains. What am I, a maid service.
zh_cn: 我讨厌下雨天，因为我是个女佣。

source: I used to use this awesome carpet cleaner I'd buy in a vat from Costco. It smelled like mustard gas, like a chemical weapon, which I guess it basically was.
zh_cn: 我以前习惯于从好市多买那种很棒的大桶装的地毯清洁剂，它闻起来有芥末的味道，像是化学武器，实际上它也可以算作是一种化学武器了。

source: It worked weapons-grade magic against my stains and I was a happy, albeit fume-y, camper.
zh_cn: 它的去污效果极强，我爱死它了，唯一的缺点就是它让我闻起来像是地毯清洁剂。

source: But that was ages ago, and in the years since then I've been on a steady march toward totally natural, totally homemade cleaning products.
zh_cn: 那是好多年前的事了，这些年来，我逐渐习惯于用全天然自制的清洁剂。

source: I mean really, is there anything that baking soda and vinegar can't do? So far, I haven't found it.
zh_cn: 说真的，难道有什么脏东西是小苏打和食醋清洁不了的吗？至少到目前为止，我还没有发现。

source: What I have found, however, is that when it comes to "green" cleaning, sometimes the technique is just as important as the ingredients.
zh_cn: 我所发现的是，当使用“绿色环保”的清洁方法时，有时使用方法和成分同样重要。

source: Case in point: vinegar as a carpet cleaner.
zh_cn: 例如：用食醋清洁地毯。

source: It works, and it works really well, but you can't just dump it on and wipe it up like it's one of those industrial strength, neon blue, store-bought monsters.
zh_cn: 它可以把地毯清洁得异常干净，但你不能像使用那些从超市买来的蓝色包装的工业去污剂一样，简单地往地毯上一泼就擦干净。

source: It takes a little more attention. A little finesse.
zh_cn: 你需要花更多的心思，使用一些技巧。

source: And with much practice (thank you, dear doggie), I finally perfected the method.
zh_cn: 经过多次练习（感谢我的狗狗让我有那么多的练习机会），我终于找到了完美的解决方案。

source: All you need is a spray bottle with a solution of half vinegar/half water, and a few old cleaning towels.
zh_cn: 你只需要准备一个喷壶，装入1：1的食醋和水配成的溶液，和几块旧抹布就行了。

source: First, it's important to get to the stain as soon as you possibly can. Whether it's pet pee or muddy footprints or spilled wine, the longer it sits just means the harder it'll be to get out.
zh_cn: 首先，你得尽快找到那块你要清洁的污迹，不管它是你宠物的粪便，泥脚印，还是洒掉的红酒。

source: So make sure you get it while it's still wet.
zh_cn: 污迹存在的时间越长，就越难清理干净，所以尽可能在它变干之前开始清理吧。

source: Lay the towel over the spill and firmly, using your fingertips or the heel of your palm, blot the liquid up.
zh_cn: 用抹布覆盖这块污迹，用你的手指或者手掌根部，朝一个方向用力把那些污水吸干。

source: Do not rub the liquid in.
zh_cn: 注意，不要来回摩擦以至于使污水深入地毯里面。

source: Blot only, yes?
zh_cn: 要吸干，明白吗？

source: That's the "method" part of this whole tutorial. Blot.
zh_cn: 这是整个教程的核心方法：吸干。

source: Blot.
zh_cn: 吸呀。

source: Continue your blotting until you have soaked up as much of the liquid as humanly possible.
zh_cn: 一直吸到污点不能变得更干为止。

source: You might go through a few towels, depending on the size of the spill you're dealing with.
zh_cn: 在此过程中，你可能需要更换几次抹布，这决定于污点的大小。

source: Now it's time to apply the vinegar.
zh_cn: 现在，该是食醋出场的时候了。

source: On the "mist" setting, spray the entire area and spray it liberally.
zh_cn: 把你的喷壶开到喷雾档，然后对准污迹喷吧。

source: Get it good and soaked.
zh_cn: 不要吝啬你的食醋溶液，要使整块污迹完全浸泡在溶液里。

source: Then, allow it to sit there for a while -- five or 10 minutes should do it.
zh_cn: 然后，静置5~10分钟。

source: Once the vinegar has had a chance to soak in and work its magic, you'll use a clean towel to soak it up.
zh_cn: 等食醋的清洁作用发挥得差不多时，你就可以用干净的抹布把它吸干了。

source: Blotting works great here, but if you're just dying to rub or even scrub, have at it!
zh_cn: 你仍然可以用吸干的方式，但如果你实在想要在上面摩擦甚至揉搓的话，我也不会反对。

source: You can even put a little elbow grease on it. Might as well give that carpet a good, deep cleaning.
zh_cn: 你甚至可以把它当成一项体力劳动，给地毯来个彻底的清洗。

source: And that's all there is to it!
zh_cn: 这就是所有你需要做的！

source: I've used this technique on so many spills, everything from party punch to baby poop.
zh_cn: 我已经用这种方法处理过千奇百怪的污迹，从派对上的果汁饮料到婴儿的粪便，都能清理干净。

source: As long as the soiling is relatively fresh, this easy eco-friendly method will always do the trick.
zh_cn: 只要你在污迹还没有变干之前就处理它，这种环保的清洁方法就永远能让你满意。

source: With no nasty fumes to leave behind; and if you want a fresh scent, try a citrus-infused cleaning vinegar!
zh_cn: 你不用担心会留下难闻的气味，但如果你想要一点清香，试着用柑橘味的清洗用醋。

source: (P.S. You can mop with vinegar too.)
zh_cn: （备注：你也可以用拖把蘸醋来清洁）

source: Of course, if that spill's coming from a leak, call your roofer before the rainy season starts to get a handle on things.
zh_cn: 当然，如果那块污迹是由于泄漏引起的，赶紧给屋顶维修工打电话，在事情变得更糟之前把它修理好。
